<script>
import {defineComponent} from "vue";
import AppBackArrow from "@/components/BackArrow.vue";

export default defineComponent({
  components: {AppBackArrow}
})
</script>

<template>
  <app-back-arrow/>
  <div class="content">
    <div class="text-block">
      <h1 class="header-text">Правила семерочки</h1>
    </div>
    <p class="text-block">
      Семерочка - спортивно-оздоровительная интеллектуальная игра, направленная на сплочение команды и развития себя
      как личности.
    </p>
    <p class="text-block">
      Ниже перечислены основные понятия игры, а за ними правила, по которым необходимо играть.
    </p>

    <p class="text-block">
      <span class="local-heading">Кон</span>
      Кон - это длительность партии, заданная колодой карт на столе. Могут быть использованы одна целая или две неполных
      колоды по 36 карт. Джокеры недопустимы.
    </p>
    <p class="text-block">
      <span class="local-heading">Входной тост</span>
      Входной тост - действие, которое выполняется в момент начала нового кона. Игроки должны произнести тост
      <span class="italic">"Да сохранит нас Господь!"</span> и выпить.
    </p>
    <p class="text-block">
      <span class="local-heading">Выходной тост</span>
      Выходной тост - действие, которое выполняется в момент окончания кона. Игроки должны произнести тост
      <span class="italic">"Спасибо, Господь, что сохранил нас!"</span> и выпить. Ведущий должен перевернуть карты.
      Пока карты не перевернуты, кон не считается завершенным.
    </p>
    <p class="text-block">
      <span class="local-heading">Стол</span>
      Стол - место для игры. Когда карты помещены на стол рубашкой вниз, все игроки обязаны сидеть за столом,
      за исключением применения карты 9. Игрок считается сидящим за столом, если любая часть тела игрока касается
      стола или стула, поставленного за столом. Столом может служить любая огорожденная судьей горизонтальная
      неподвижная поверхность. Игрок, который вышел из-за стола, отправляется в аут и пьет 200 мл действующего алкоголя.
    </p>
    <p class="text-block">
      <span class="local-heading">Официальные лица</span>
      Официальные лица, или судьи, - это люди, которые контролируют процесс игры и следят за выполнением правил.
      Слово судьи - закон. Игроки не имеют права не выполнить решение судьи.
      И игроки, и судьи подчиняются всем приведенным правилам, за исключением команды <span
        class="command">Ejection</span>.
      Игроки обязаны уважительно относиться к судьям. В свою очередь, судьи также обязаны уважительно относиться к
      игрокам.
    </p>

    <h2 class="subheader-text">
      Команды
    </h2>

    <p class="text-block">
      В игре существуют три основные команды, объявляемые судьей.
    </p>
    <p class="text-block">
      <span class="local-heading">Команда <span class="command">Safe</span></span>
      Если судья объявляет команды <span class="command">Safe</span> и разводит руки в стороны, это значит, что игрок
      в безопасности и не обязан пить, за исключением действия карты 8.
    </p>
    <p class="text-block">
      <span class="local-heading">Команда <span class="command">Out</span></span>
      Если судья объявляет команду <span class="command">Out</span>, при этом показывает на игрока одной рукой и
      поднимает другую в кулаке,
      это значит, что игрок нарушил правило и обязан выпить.
    </p>
    <div class="text-block">
      <span class="local-heading">Команда <span class="command">Ejection</span></span>
      Если судья объявляет команду <span class="command">Ejection</span>, встает из-за стола и показывает на игрока
      рукой, другой сторону показывая
      в сторону выхода, это значит, что игрок грубо нарушает правила, и он дисквалифицирован. Причины для
      дисквалификации:
      <ol type="a" class="list">
        <li>Неадекватное поведение игрока. Команда: покрутить пальцем у виска.</li>
        <li>Неспортивное поведение игрока. Команда: расставить руки в стороны.</li>
        <li>Жульничество. Команда: удар одной рукой о вторую.</li>
        <li>Потеря игроком сознания. Команда: прислонить ладонь к лицу. В этом случае судья обязан перед
          дисквалификацией
          отсчитать игрока, убедившись, что тот действительно не в состоянии продолжать игру.
        </li>
        <li>Пассивная игра. Команда: руки на поясе. В этом случае, судья обязан поднять руки вверх. Затем все игроки
          должны поднять обе руки. Пассивного игрока необходимо отсчитать, чтобы убедиться, что он действительно ведет
          пассивную игру.
        </li>
      </ol>
    </div>
    <p class="text-block">
      <span class="local-heading">Отсчет</span>
      Отсчет - действие судьи, в случае если игра не продолжается по тем или иным причинам по вине определенного игрока.
      Отсчет ведется тремя щелчками пальцев. В случае если игрок вернулся в игру и выполнил требуемое от него действие,
      игрок обязан выпить с тостом, в случае если таковой имеется, после чего признается оправданным.
      Исключение - вспоминание тоста. В таком случае, отсчет ведется 10 щелчками пальцев.
    </p>
    <p class="text-block">
      <span class="local-heading">Технический перерыв</span>
      Команда: судья машет руками над головой. Остановка игры по тем или иным причинам, на усмотрение судьи.
      Игроки имеют право выйти из-за стола.
    </p>
    <p class="text-block">
      Судья не может отсчитать или дисквалифицировать самого себя - это делается вторым судьей.
    </p>
    <p class="text-block">
      Судьи имеют право участвовать в игре. При этом, после шестого кона один из судей обязан покинуть стол и судить вне
      игры.
    </p>

    <h2 class="subheader-text">
      Правила игры
    </h2>

    <p class="text-block">
      Игра расчитана на 2-10 игроков за одним столом. В центр стола выкладывается колода. Игроки начинают тянуть карты
      по очереди по часовой стрелке, пока колода не закончится. Цель игры - выжить. Для победы необходимо будучи
      единственным
      оставшимся игроком произнести выходной тост и поднять руку.
    </p>
    <p class="text-block">
      Ничто не запрещает игроку пить без необходимости на протяжении кона. При этом карта Валет не действует.
    </p>

    <h2 class="subheader-text">
      Значения карт
    </h2>

    <p class="text-block">
      По мере игры игрок будет вытягивать карты и, в зависимости от номинала карты, выполнять то или иное действие.
    </p>

    <p class="text-block">
      <span class="local-heading">Карта 6. Тема для разговора</span>
      Игрок обязан придумать перечисляемую тему для разговора, такую, чтобы следующие игроки могли поддержать ее словом
      или словосочетанием. Игрок, который не сможет поддержать тему, назовет неправильный или повторяющийся вариант,
      отправляется в <span class="command">аут</span> по указу судьи.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта 7. Семерочка</span>
      Игрок, вытянувший 7, должен начать отсчет натуральных чисел, начиная с 7, в порядке возрастания. Числа должны быть
      либо кратны 7, либо содержать в себе 7. Если игрок не может поддержать счет по отсчету судьи до 3 щелчков пальцев
      или назовет неверное число, игрок отправляется в <span class="command">аут</span>. Судья может остановить действие
      карты командой <span class="command">Safe</span>, если отсчет затянется надолго.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта 8</span>
      Все игроки обязаны поднять правую ладонь выше головы. Последний игрок отправляется в аут. Последний игрок
      объявляется
      судьей. В случае, если последний игрок не был выявлен, объявляется команда <span class="command">Safe</span>.
      После нее игроки обязаны поднять левую ладонь выше головы. Последний игрок по указу судьи отправляется в
      <span class="command">аут</span>. В том случае, если после второго раза проигравшего выявить не удалось,
      объявляется команда <span class="command">Safe</span>, и игра продолжается.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта 9. Выход из-за стола</span>
      Игрок, который вытянул карту 9, имеет право выйти из-за стола на 60 секунд. Время засекает судья. Если игрок не
      успевает вернуться за стол в течение 60 секунд, он пьет 200 мл действующего алкоголя. Игрок имеет право передать
      карту 9 любому игроку за столом. При этом, игрок, которому передали право на карту 9, отправляется в
      <span class="command">аут</span>, но все еще имеет право воспользоваться картой.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта 10. Человек-вопрос</span>
      Игрок, вытянувший карту 10, объявляется человеком-вопросом. Любой ответ на его вопрос, вербальный или
      невербальный,
      отправляет отвечающего в <span class="command">аут</span>. Действие карты продолжается до следующей вытянутой
      карты 10,
      либо же до конца кона.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта Валет</span>
      Если игрок вытягивает вальта, то все игроки отправляются в <span class="command">аут</span>. Перед этим,
      вытянувший
      говорит новый тост. Далее все игроки за столом каждый раз, когда им необходимо выпить, говорят этот тост.
      Карта действует до следующего вальта, либо же до конца кона.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта Дама</span>
      Пропуск хода. Ход переходит к следующему игроку.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта Король</span>
      Игрок, вытянувший короля, отправляется в <span class="command">аут</span>.
    </p>
    <p class="text-block">
      <span class="local-heading">Карта Туз</span>
      Игрок, вытянувший туза, отправляет весь стол, кроме него самого, в <span class="command">аут</span>.
    </p>

    <h2 class="subheader-text">
      Рекомендации по турнирному проведению
    </h2>

    <p class="text-block">
      По соглашению, имевшему место 17.09.2018, были приняты рекомендации по турнирному проведению в части усреднения
      потребляемого алкоголя у всех игроков в зависимости от номера текущего кона:
    </p>
    <div class="text-block">
      <ul class="list">
        <li>1-3 кон: легкий алкоголь (пиво, сидр, медовуха) - 50 мл</li>
        <li>4-6 кон: средний алкоголь (вино, шампанское, портвейн, ликеры) - 50 мл</li>
        <li>7-13 кон: крепкий алкоголь с возможностью запивки - 25 мл</li>
        <li>14-99 кон: крепкий алкоголь без возможности запивки - 50 мл</li>
        <li>Коны, начиная с 100-го, правилами не регулируются</li>
      </ul>
    </div>
  </div>
</template>

<style scoped>

.content {
  width: 80vw;
  max-height: 85vh;
  margin: 0 auto;
  color: var(--white);
  overflow-y: scroll;
}

.subheader-text {
  font-size: 32px;
  text-align: center;
  font-style: italic;
}

.local-heading {
  display: block;
  margin-bottom: 10px;
  font-style: italic;
}

.command {
  font-style: italic;
  color: var(--light-blue);
}

.list {
  padding-left: 40px;
}

</style>